import React from "react";
import Article from "../component/Article";

function Timeline() {
    return (
        <Article>
            <h1>第四届上海市上海中学最受欢迎动漫人物赏 比赛赛程</h1>
            <h2>提名阶段</h2>
            <p>提名阶段截止日期为10月12日，本网站将于10月12日早8点停止接收线上提名。</p>
            <h2>预选赛阶段</h2>
            <p>预选赛于10月20日开始，线下截止日期为11月7日，线上截止日期为11月10日，本网站将于11月10日24点停止接收预选赛选票。</p>
            <p>预选赛的所有人将随机分为男12组、女16组进行投票，每组可投三票，每组第一名将出线参加八强赛，共12男，16女进入八强赛。</p>
            <a href="/4/上萌预选赛得票统计表.pdf" target={"_blank"}>上萌预选赛得票统计表</a>
            <h2>八强赛阶段</h2>
            <p>八强赛于11月23日开始，线下截止日期为11月28日，线上截止日期为11月29日，本网站将于11月29日23点停止接收八强赛选票。</p>
            <a href="/4/上萌八强赛名单.pdf" target={"_blank"}>上萌八强赛名单</a>
            <h2>四强赛阶段</h2>
            <p>四强赛于11月30日开始，线下截止日期为12月5日，线上截止日期为12月6日，本网站将于12月6日23点停止接收四强赛选票。</p>
            <h2>半决赛阶段</h2>
            <p>半决赛于12月7日开始，线下截止日期为12月12日，线上截止日期为12月13日，本网站将于12月13日23点停止接收半决赛选票。</p>
            <h2>总决赛阶段</h2>
            <p>总决赛于12月14日开始，于狂欢夜当日（29日）截止，具体安排请关注和风社相关通知！</p>
        </Article>
    )
}

export default Timeline;